import numpy as np
arr=np.arange(16).reshape((2,2,4))
# transpose 维度转换函数
'''
[[[ 0  1  2  3]
[ 4  5  6  7]]
[[ 8  9 10 11]
[12 13 14 15]]]
'''
# 切记这里的2,1,0是上面维度的代号就是0表示1维 1表示第二维度以此类推
arr_t = arr.transpose(1,0,2)

# 看输出arr_t像是被打乱了前面的因为a是一个3维向量所以transpose后面的参数变成了维度的代号
# 输出：
'''
[[[ 0  8]
  [ 4 12]]

 [[ 1  9]
  [ 5 13]]

 [[ 2 10]
  [ 6 14]]

 [[ 3 11]
  [ 7 15]]]
'''

# 取出一个数值
arr_num = arr[0,1,3]
# 注意取值的时候还是 以原来的维度进行取值 只是索引维度是转变后的维度


arr_num2 = arr_t[1,0,3]

# swapaxes接受一对维度编号进行维度转变
arr_s = arr.swapaxes(2,1) #将第三个维度和第二个维度交换
print(arr_s)
